; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v11 ?v2)
             (pred_5 ?v1 ?v12)
             (pred_3 ?v11 ?v12)
             (pred_12 ?v4 ?v11 )
	     (pred_1 ?v11)
             (pred_2 ?v10)
             (pred_11 ?v1)
             (pred_9 ?v12)
             (pred_6 ?v11)
             (pred_10 ?v1)
             (pred_4 ?v11)
             (pred_8 ))



(:action op_5
:parameters (?v9 ?v6 ?v5 ?v3)
:precondition (and (pred_2 ?v9) (pred_2 ?v6) (pred_11 ?v5) (pred_9 ?v3)
          (pred_7 ?v9 ?v6) (pred_5 ?v5 ?v3)
                   (pred_3 ?v6 ?v3) (pred_1 ?v9) 
                   (pred_6 ?v6) (pred_10 ?v5))
:effect (and  (pred_4 ?v6) (not (pred_6 ?v6))))


(:action op_1
:parameters (?v9 ?v7)
:precondition (and (pred_2 ?v9) (pred_2 ?v7)
               (pred_1 ?v9) (pred_7 ?v9 ?v7) (pred_4 ?v7))
:effect (and (pred_1 ?v7) (not (pred_1 ?v9))))

(:action op_3
:parameters (?v9 ?v5)
:precondition (and (pred_2 ?v9) (pred_11 ?v5) 
                  (pred_1 ?v9) (pred_12 ?v5 ?v9) (pred_8 ))
:effect (and (pred_10 ?v5)
   (not (pred_12 ?v5 ?v9)) (not (pred_8 ))))


(:action op_4
:parameters (?v9 ?v8 ?v13)
:precondition (and (pred_2 ?v9) (pred_11 ?v8) (pred_11 ?v13)
                  (pred_1 ?v9) (pred_10 ?v13) (pred_12 ?v8 ?v9))
:effect (and (pred_10 ?v8) (pred_12 ?v13 ?v9)
        (not (pred_10 ?v13)) (not (pred_12 ?v8 ?v9))))

(:action op_2
:parameters (?v9 ?v5)
:precondition (and (pred_2 ?v9) (pred_11 ?v5) 
                  (pred_1 ?v9) (pred_10 ?v5))
:effect (and (pred_8 ) (pred_12 ?v5 ?v9) (not (pred_10 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_22 obj_05 obj_07 obj_09 obj_17 obj_06 obj_13 obj_11 obj_04 obj_14 obj_01 obj_18 obj_15 obj_10 obj_20
    obj_12 obj_02 obj_08
    obj_19 obj_21 obj_16
    )

    (:init
       (pred_8)

       (pred_2 obj_03)
       (pred_2 obj_22)
       (pred_2 obj_05)
       (pred_2 obj_07)
       (pred_2 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_06)
       (pred_2 obj_13)
       (pred_2 obj_11)
       (pred_2 obj_04)
       (pred_2 obj_14)
       (pred_2 obj_01)
       (pred_2 obj_18)
       (pred_2 obj_15)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_9 obj_12)
       (pred_9 obj_02)
       (pred_9 obj_08)
       (pred_11 obj_19)
       (pred_11 obj_21)
       (pred_11 obj_16)

       (pred_7 obj_03 obj_09)
       (pred_7 obj_03 obj_22)
       (pred_7 obj_22 obj_17)
       (pred_7 obj_22 obj_05)
       (pred_7 obj_22 obj_03)
       (pred_7 obj_05 obj_06)
       (pred_7 obj_05 obj_07)
       (pred_7 obj_05 obj_22)
       (pred_7 obj_07 obj_13)
       (pred_7 obj_07 obj_05)
       (pred_7 obj_09 obj_11)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_09 obj_03)
       (pred_7 obj_17 obj_04)
       (pred_7 obj_17 obj_06)
       (pred_7 obj_17 obj_22)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_06 obj_13)
       (pred_7 obj_06 obj_05)
       (pred_7 obj_06 obj_17)
       (pred_7 obj_13 obj_01)
       (pred_7 obj_13 obj_07)
       (pred_7 obj_13 obj_06)
       (pred_7 obj_11 obj_18)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_09)
       (pred_7 obj_04 obj_15)
       (pred_7 obj_04 obj_14)
       (pred_7 obj_04 obj_17)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_14 obj_10)
       (pred_7 obj_14 obj_01)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_14 obj_04)
       (pred_7 obj_01 obj_20)
       (pred_7 obj_01 obj_13)
       (pred_7 obj_01 obj_14)
       (pred_7 obj_18 obj_15)
       (pred_7 obj_18 obj_11)
       (pred_7 obj_15 obj_10)
       (pred_7 obj_15 obj_04)
       (pred_7 obj_15 obj_18)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_10 obj_14)
       (pred_7 obj_10 obj_15)
       (pred_7 obj_20 obj_01)
       (pred_7 obj_20 obj_10)
       (pred_6 obj_17)
       (pred_6 obj_07)
       (pred_6 obj_03)
       (pred_3  obj_17 obj_12)
       (pred_3  obj_07 obj_02)
       (pred_3  obj_03 obj_08)
       (pred_4 obj_22)
       (pred_4 obj_05)
       (pred_4 obj_09)
       (pred_4 obj_06)
       (pred_4 obj_13)
       (pred_4 obj_11)
       (pred_4 obj_04)
       (pred_4 obj_14)
       (pred_4 obj_01)
       (pred_4 obj_18)
       (pred_4 obj_15)
       (pred_4 obj_10)
       (pred_4 obj_20)

       (pred_5  obj_19 obj_12)
       (pred_5  obj_21 obj_02)
       (pred_5  obj_16 obj_08)
       (pred_12 obj_19 obj_22)
       (pred_12 obj_21 obj_22)
       (pred_12 obj_16 obj_05)
       (pred_1 obj_20)
    )

    (:goal (and
       (pred_12 obj_16 obj_03)
    ))
(:constraints
  (always (not (pred_1 obj_01)))
)
)

; plan
1. (op_1 obj_20 obj_10)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_10)
   goals met: 0 of 1
2. (op_1 obj_10 obj_14)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_14)
   goals met: 0 of 1
3. (op_1 obj_14 obj_06)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_06)
   goals met: 0 of 1
4. (op_1 obj_06 obj_05)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_05)
   goals met: 0 of 1
5. (op_3 obj_05 obj_16)
   deleted: (pred_12 obj_16 obj_05) (pred_8)
   added: (pred_10 obj_16)
   goals met: 0 of 1
6. (op_1 obj_05 obj_22)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_22)
   goals met: 0 of 1
7. (op_5 obj_22 obj_03 obj_16 obj_08)
   deleted: (pred_6 obj_03)
   added: (pred_4 obj_03)
   goals met: 0 of 1
8. (op_1 obj_22 obj_03)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_03)
   goals met: 0 of 1
9. (op_2 obj_03 obj_16)
   deleted: (pred_10 obj_16)
   added: (pred_8) (pred_12 obj_16 obj_03)
   goals met: 1 of 1
